const description = `
Публикации физических лиц без предпринимательской деятельности публикуются бесплатно (1 объявление в неделю) для этого обратитесь к администратору @pravodoc_ru. Публикация рекламных предложений единоразово стоит 100₽. Так же есть пакетные тарифы на публикацию объявлений. Подробнее об этих тарифах можно узнать у Администратора. Если у вас одно рекламное размещение, то нажмите на кнопку "Рекламная публикация", оплатите счет и пришлите/перешлите сюда (боту) уже готовое (форматированное по следующему принципу: фото, описание с указанием контактной информации) объявление для публикации. Рекомендуется заранее подготовить такое объявление и переслать боту. Если оплатили и объявление опубликовалось не правильно / не опубликовалось обращайтесь к Администратору.
`

module.exports.description = description;


//Правила публикации сообщений в телеграм канале
